app/controllers/broadcasts_controller.rb

  def index
    begin
      @broadcasts = Broadcast.paginate(page: params[:page],
                                       per_page: params[:per_page])
                        .order('created_at DESC').to_a
---
SELECT  "broadcasts".* FROM "broadcasts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]

  def create

    @broadcast = Broadcast.new(broadcast_params)

    # Wire up broadcast with the current user (an administrator)
    # Will be an admin user (see before_action)
    # Note the current_user is a user_detail object so we need
    # to navigate to its user object
    @broadcast.user = current_user.user

    # Doing the next line forces a save automatically. I want to defer this
    # until the "if" statement
    #current_user.user.broadcasts << @broadcast

    no_errors = false
    respond_to do |format|
      if @broadcast.save
---
INSERT INTO "broadcasts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "testing actioncable"], ["user_id", 1], ["created_at", 2016-12-11 10:47:08 UTC], ["updated_at", 2016-12-11 10:47:08 UTC]]

  def set_broadcast
    @broadcast = Broadcast.find(params[:id])
---
SELECT  "broadcasts".* FROM "broadcasts" WHERE "broadcasts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]