app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY surname, firstname LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
      @users = User.paginate(page: params[:page],
                             per_page: params[:per_page])
                   .order('surname, firstname')

INSERT INTO "users" ("surname", "firstname", "phone", "grad_year", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)


    # Only create a new image if the :image_file parameter
    # was specified
    @image = Image.new(photo: params[:image_file]) if params[:image_file]

    # The ImageService model wraps up application logic to
    # handle saving images correctly
    @service = ImageService.new(@user, @image)

    respond_to do |format|
      if @service.save # Will attempt to save user and image